[Killed] ArithmeticOperator
lib/date-utils.ts:14:24
 export function toISOLocalDate(date: Date): string {
   const d = toLocalMidnight(date);
   const year = d.getFullYear();
-  const month = String(d.getMonth() + 1).padStart(2, '0');
+  const month = String(d.getMonth() - 1).padStart(2, '0');
   const day = String(d.getDate()).padStart(2, '0');
   return `${year}-${month}-${day}`;
killedBy: All tests
statusReason: FAIL tests/date-utils.test.ts (6.869 s)

  ● Date Utils › toISOLocalDate › should format date as YYYY-MM-DD in local time

    expect(received).toBe(expected) // Object.is equality

    Expected: "2023-01-05"
    Received: "2023--1-05"

[Killed] ConditionalExpression
lib/date-utils.ts:25:7
  * Prevents timezone shifting by parsing YYYY-MM-DD components directly from strings.
  */
 export function parseISOLocal(dateValue: Date | string | number | { startDate?: string; start_date?: string } | null | undefined): Date {
-  if (!dateValue) return new Date();
+  if (false) return new Date();
 
   // Handle Date objects
killedBy: All tests
statusReason: FAIL tests/date-utils.test.ts

  ● Date Utils › parseISOLocal › should handle null/undefined by returning current date

    TypeError: Cannot use 'in' operator to search for 'startDate' in null

      80 |
      81 |   // Handle objects with startDate/start_date properties

[Killed] BooleanLiteral
lib/date-utils.ts:25:7
  * Prevents timezone shifting by parsing YYYY-MM-DD components directly from strings.
  */
 export function parseISOLocal(dateValue: Date | string | number | { startDate?: string; start_date?: string } | null | undefined): Date {
-  if (!dateValue) return new Date();
+  if (dateValue) return new Date();
 
   // Handle Date objects
killedBy: All tests
statusReason: FAIL tests/date-utils.test.ts
  ● Date Utils › parseISOLocal › should parse YYYY-MM-DD string correctly

    expect(received).toBe(expected) // Object.is equality

    Expected: 2023
    Received: 2026

[Killed] ConditionalExpression
lib/date-utils.ts:28:7
   if (!dateValue) return new Date();
 
   // Handle Date objects
-  if (dateValue instanceof Date) {
+  if (true) {
     return new Date(dateValue.getFullYear(), dateValue.getMonth(), dateValue.getDate());
   }
killedBy: All tests
statusReason: FAIL tests/date-utils.test.ts

  ● Date Utils › parseISOLocal › should parse YYYY-MM-DD string correctly

    TypeError: dateValue.getFullYear is not a function

      76 |   // Handle Date objects
      77 |   if (stryMutAct_9fa48("11") ? false : stryMutAct_9fa48("10") ? true : (stryCov_9fa48("10", "11"), dateValue instanceof Date)) {

[Survived] ConditionalExpression
lib/date-utils.ts:28:7
   if (!dateValue) return new Date();
 
   // Handle Date objects
-  if (dateValue instanceof Date) {
+  if (false) {
     return new Date(dateValue.getFullYear(), dateValue.getMonth(), dateValue.getDate());
   }

[Killed] LogicalOperator
lib/date-utils.ts:33:41
   }
 
   // Handle objects with startDate/start_date properties
-  if (typeof dateValue === 'object' && ('startDate' in dateValue || 'start_date' in dateValue)) {
+  if (typeof dateValue === 'object' && ('startDate' in dateValue && 'start_date' in dateValue)) {
     const val = dateValue.startDate || dateValue.start_date;
     const dateStr = String(val);
killedBy: All tests
statusReason: FAIL tests/date-utils.test.ts

  ● Date Utils › parseISOLocal › should handle object with startDate

    expect(received).toBe(expected) // Object.is equality

    Expected: 2023
    Received: 2026

[Killed] ConditionalExpression
lib/date-utils.ts:33:7
   }
 
   // Handle objects with startDate/start_date properties
-  if (typeof dateValue === 'object' && ('startDate' in dateValue || 'start_date' in dateValue)) {
+  if (false) {
     const val = dateValue.startDate || dateValue.start_date;
     const dateStr = String(val);
killedBy: All tests
statusReason: FAIL tests/date-utils.test.ts
  ● Date Utils › parseISOLocal › should handle object with startDate

    expect(received).toBe(expected) // Object.is equality

    Expected: 2023
    Received: 2026

[Killed] LogicalOperator
lib/date-utils.ts:34:17
 
   // Handle objects with startDate/start_date properties
   if (typeof dateValue === 'object' && ('startDate' in dateValue || 'start_date' in dateValue)) {
-    const val = dateValue.startDate || dateValue.start_date;
+    const val = dateValue.startDate && dateValue.start_date;
     const dateStr = String(val);
     const match = dateStr.match(/^(\d{4})-(\d{2})-(\d{2})/);
killedBy: All tests
statusReason: FAIL tests/date-utils.test.ts
  ● Date Utils › parseISOLocal › should handle object with startDate

    expect(received).toBe(expected) // Object.is equality

    Expected: 2023
    Received: 2026

[Killed] ConditionalExpression
lib/date-utils.ts:34:17
 
   // Handle objects with startDate/start_date properties
   if (typeof dateValue === 'object' && ('startDate' in dateValue || 'start_date' in dateValue)) {
-    const val = dateValue.startDate || dateValue.start_date;
+    const val = true;
     const dateStr = String(val);
     const match = dateStr.match(/^(\d{4})-(\d{2})-(\d{2})/);
killedBy: All tests
statusReason: FAIL tests/date-utils.test.ts
  ● Date Utils › parseISOLocal › should handle object with startDate

    expect(received).toBe(expected) // Object.is equality

    Expected: 2023
    Received: 2026

[Killed] ConditionalExpression
lib/date-utils.ts:37:9
     const val = dateValue.startDate || dateValue.start_date;
     const dateStr = String(val);
     const match = dateStr.match(/^(\d{4})-(\d{2})-(\d{2})/);
-    if (match) {
+    if (false) {
       const year = parseInt(match[1], 10);
       const month = parseInt(match[2], 10) - 1;
killedBy: All tests
statusReason: FAIL tests/date-utils.test.ts

  ● Date Utils › parseISOLocal › should handle object with startDate

    expect(received).toBe(expected) // Object.is equality

    Expected: 2023
    Received: 2026

[Survived] ConditionalExpression
lib/date-utils.ts:37:9
     const val = dateValue.startDate || dateValue.start_date;
     const dateStr = String(val);
     const match = dateStr.match(/^(\d{4})-(\d{2})-(\d{2})/);
-    if (match) {
+    if (true) {
       const year = parseInt(match[1], 10);
       const month = parseInt(match[2], 10) - 1;

[Killed] ArithmeticOperator
lib/date-utils.ts:39:21
     const match = dateStr.match(/^(\d{4})-(\d{2})-(\d{2})/);
     if (match) {
       const year = parseInt(match[1], 10);
-      const month = parseInt(match[2], 10) - 1;
+      const month = parseInt(match[2], 10) + 1;
       const day = parseInt(match[3], 10);
       return new Date(year, month, day);
killedBy: All tests
statusReason: FAIL tests/date-utils.test.ts

  ● Date Utils › parseISOLocal › should handle object with startDate

    expect(received).toBe(expected) // Object.is equality

    Expected: 2023
    Received: 2024

[Survived] ConditionalExpression
lib/date-utils.ts:58:5
 
 // Fallback for other formats
 const date = new Date(dateStr);
-if (isNaN(date.getTime())) return new Date();
+if (false) return new Date();
 
 return new Date(date.getFullYear(), date.getMonth(), date.getDate());

[Survived] ConditionalExpression
lib/date-utils.ts:58:5
 
 // Fallback for other formats
 const date = new Date(dateStr);
-if (isNaN(date.getTime())) return new Date();
+if (true) return new Date();
 
 return new Date(date.getFullYear(), date.getMonth(), date.getDate());

[Killed] ConditionalExpression
lib/date-utils.ts:67:20
   const d = toLocalMidnight(date);
   const s = toLocalMidnight(start);
   const e = toLocalMidnight(end);
-  return d >= s && d <= e;
+  return d >= s && true;
 }
 
killedBy: All tests
statusReason: FAIL tests/date-utils.test.ts

  ● Date Utils › isDateInRange › should return false for date outside range (before)

    expect(received).toBe(expected) // Object.is equality

    Expected: false
    Received: true

[Killed] EqualityOperator
lib/date-utils.ts:67:10
   const d = toLocalMidnight(date);
   const s = toLocalMidnight(start);
   const e = toLocalMidnight(end);
-  return d >= s && d <= e;
+  return d > s && d <= e;
 }
 
killedBy: All tests
statusReason: FAIL tests/date-utils.test.ts

  ● Date Utils › isDateInRange › should return true for date at start boundary

    expect(received).toBe(expected) // Object.is equality

    Expected: true
    Received: false

[Killed] ConditionalExpression
lib/date-utils.ts:75:5
  * Used for API responses.
  */
 export function safeToISOString(value: Date | string | number | { startDate?: string; start_date?: string; endDate?: string; end_date?: string } | null): string {
-if (!value) return new Date().toISOString();
+if (true) return new Date().toISOString();
 
 let date: Date;
killedBy: All tests
statusReason: FAIL tests/date-utils.test.ts

  ● Date Utils › safeToISOString › should convert Date to ISO string

    expect(received).toBe(expected) // Object.is equality

    Expected: "2023-01-01T00:00:00.000Z"
    Received: "2026-04-29T22:18:56.603Z"

[Killed] BooleanLiteral
lib/date-utils.ts:75:5
  * Used for API responses.
  */
 export function safeToISOString(value: Date | string | number | { startDate?: string; start_date?: string; endDate?: string; end_date?: string } | null): string {
-if (!value) return new Date().toISOString();
+if (value) return new Date().toISOString();
 
 let date: Date;
killedBy: All tests
statusReason: FAIL tests/date-utils.test.ts

  ● Date Utils › safeToISOString › should convert Date to ISO string

    expect(received).toBe(expected) // Object.is equality

    Expected: "2023-01-01T00:00:00.000Z"
    Received: "2026-04-29T22:18:53.174Z"

[Killed] ConditionalExpression
lib/date-utils.ts:78:5
 if (!value) return new Date().toISOString();
 
 let date: Date;
-if (value instanceof Date) {
+if (true) {
 date = value;
 } else if (typeof value === 'string' || typeof value === 'number') {
killedBy: All tests
statusReason: FAIL tests/date-utils.test.ts

  ● Date Utils › safeToISOString › should handle string input that is not a valid date and call console.warn

    TypeError: date.getTime is not a function

      137 |     date = new Date(String(value));
      138 |   }

[Survived] ConditionalExpression
lib/date-utils.ts:78:5
 if (!value) return new Date().toISOString();
 
 let date: Date;
-if (value instanceof Date) {
+if (false) {
 date = value;
 } else if (typeof value === 'string' || typeof value === 'number') {

[Killed] ConditionalExpression
lib/date-utils.ts:80:41
 let date: Date;
 if (value instanceof Date) {
 date = value;
-} else if (typeof value === 'string' || typeof value === 'number') {
+} else if (typeof value === 'string' || false) {
 date = new Date(value);
 } else {
killedBy: All tests
statusReason: FAIL tests/date-utils.test.ts

  ● Console

    console.warn
      safeToISOString: Invalid date value received: 1689811200000

      138 |   }

[Killed] ConditionalExpression
lib/date-utils.ts:80:12
 let date: Date;
 if (value instanceof Date) {
 date = value;
-} else if (typeof value === 'string' || typeof value === 'number') {
+} else if (true) {
 date = new Date(value);
 } else {
killedBy: All tests
statusReason: FAIL tests/date-utils.test.ts

  ● Console

    console.warn
      safeToISOString: Invalid date value received: { startDate: '2023-08-10' }

      138 |   }

[Killed] LogicalOperator
lib/date-utils.ts:84:22
 date = new Date(value);
 } else {
 // Check for common DB property names if passed the whole object by mistake
-const possibleDate = value.startDate || value.start_date || value.endDate || value.end_date;
+const possibleDate = (value.startDate || value.start_date || value.endDate) && value.end_date;
 if (possibleDate) return safeToISOString(possibleDate);
 date = new Date(String(value));
killedBy: All tests
statusReason: FAIL tests/date-utils.test.ts

  ● Console

    console.warn
      safeToISOString: Invalid date value received: { startDate: '2023-08-10' }

      138 |   }

[Killed] LogicalOperator
lib/date-utils.ts:84:22
 date = new Date(value);
 } else {
 // Check for common DB property names if passed the whole object by mistake
-const possibleDate = value.startDate || value.start_date || value.endDate || value.end_date;
+const possibleDate = value.startDate && value.start_date || value.endDate || value.end_date;
 if (possibleDate) return safeToISOString(possibleDate);
 date = new Date(String(value));
killedBy: All tests
statusReason: FAIL tests/date-utils.test.ts

  ● Console

    console.warn
      safeToISOString: Invalid date value received: { startDate: '2023-08-10' }

      138 |   }

[Killed] ConditionalExpression
lib/date-utils.ts:85:5
 } else {
 // Check for common DB property names if passed the whole object by mistake
 const possibleDate = value.startDate || value.start_date || value.endDate || value.end_date;
-if (possibleDate) return safeToISOString(possibleDate);
+if (false) return safeToISOString(possibleDate);
 date = new Date(String(value));
 }
killedBy: All tests
statusReason: FAIL tests/date-utils.test.ts

  ● Console

    console.warn
      safeToISOString: Invalid date value received: { startDate: '2023-08-10' }

      138 |   }

[Survived] ConditionalExpression
lib/date-utils.ts:85:5
 } else {
 // Check for common DB property names if passed the whole object by mistake
 const possibleDate = value.startDate || value.start_date || value.endDate || value.end_date;
-if (possibleDate) return safeToISOString(possibleDate);
+if (true) return safeToISOString(possibleDate);
 date = new Date(String(value));
 }

[Killed] ConditionalExpression
lib/date-utils.ts:89:7
 date = new Date(String(value));
 }
   
-  if (isNaN(date.getTime())) {
+  if (false) {
     console.warn("safeToISOString: Invalid date value received:", value);
     return new Date().toISOString();
killedBy: All tests
statusReason: FAIL tests/date-utils.test.ts
  ● Date Utils › safeToISOString › should handle Invalid Date object and call console.warn

    RangeError: Invalid time value

[Killed] ConditionalExpression
lib/date-utils.ts:89:7
 date = new Date(String(value));
 }
   
-  if (isNaN(date.getTime())) {
+  if (true) {
     console.warn("safeToISOString: Invalid date value received:", value);
     return new Date().toISOString();
killedBy: All tests
statusReason: FAIL tests/date-utils.test.ts

  ● Console

    console.warn
      safeToISOString: Invalid date value received: 2023-01-01T00:00:00.000Z

      138 |   }
