[Killed] ArithmeticOperator
lib/math-utils.ts:7:10
 }
 
 export function isEven(num: number): boolean {
-  return num % 2 === 0;
+  return num * 2 === 0;
 }
 
killedBy: All tests
statusReason: FAIL tests/math-utils.test.ts

  ● Math Utils › isEven › should return true for even numbers

    expect(received).toBe(expected) // Object.is equality

    Expected: true
    Received: false

[Killed] ConditionalExpression
lib/math-utils.ts:7:10
 }
 
 export function isEven(num: number): boolean {
-  return num % 2 === 0;
+  return true;
 }
 
killedBy: All tests
statusReason: FAIL tests/math-utils.test.ts

  ● Math Utils › isEven › should return false for odd numbers

    expect(received).toBe(expected) // Object.is equality

    Expected: false
    Received: true

[Killed] ConditionalExpression
lib/math-utils.ts:11:7
 }
 
 export function calculateDiscount(price: number, discount: number): number {
-  if (discount > 0) {
+  if (false) {
     return price - (price * discount / 100);
   }
killedBy: All tests
statusReason: FAIL tests/math-utils.test.ts

  ● Math Utils › calculateDiscount › should calculate discount correctly

    expect(received).toBe(expected) // Object.is equality

    Expected: 90
    Received: 100

[Killed] ConditionalExpression
lib/math-utils.ts:11:7
 }
 
 export function calculateDiscount(price: number, discount: number): number {
-  if (discount > 0) {
+  if (true) {
     return price - (price * discount / 100);
   }
killedBy: All tests
statusReason: FAIL tests/math-utils.test.ts

  ● Math Utils › calculateDiscount › should return original price for negative discounts

    expect(received).toBe(expected) // Object.is equality

    Expected: 100
    Received: 110

[Killed] ArithmeticOperator
lib/math-utils.ts:12:21
 
 export function calculateDiscount(price: number, discount: number): number {
   if (discount > 0) {
-    return price - (price * discount / 100);
+    return price - (price / discount / 100);
   }
   return price;
killedBy: All tests
statusReason: FAIL tests/math-utils.test.ts

  ● Math Utils › calculateDiscount › should calculate discount correctly

    expect(received).toBe(expected) // Object.is equality

    Expected: 90
    Received: 99.9

[Killed] ArithmeticOperator
lib/math-utils.ts:12:12
 
 export function calculateDiscount(price: number, discount: number): number {
   if (discount > 0) {
-    return price - (price * discount / 100);
+    return price + price * discount / 100;
   }
   return price;
killedBy: All tests
statusReason: FAIL tests/math-utils.test.ts

  ● Math Utils › calculateDiscount › should calculate discount correctly

    expect(received).toBe(expected) // Object.is equality

    Expected: 90
    Received: 110

[Killed] EqualityOperator
lib/math-utils.ts:19:10
 
 // Add a function to test edge cases
 export function isPositive(num: number): boolean {
-  return num > 0;
+  return num <= 0;
 }
killedBy: All tests
statusReason: FAIL tests/math-utils.test.ts
  ● Math Utils › isPositive › should return true for positive numbers

    expect(received).toBe(expected) // Object.is equality

    Expected: true
    Received: false

[Killed] EqualityOperator
lib/math-utils.ts:19:10
 
 // Add a function to test edge cases
 export function isPositive(num: number): boolean {
-  return num > 0;
+  return num >= 0;
 }
killedBy: All tests
statusReason: FAIL tests/math-utils.test.ts

  ● Math Utils › isPositive › should return false for zero

    expect(received).toBe(expected) // Object.is equality

    Expected: false
    Received: true
